<?php
// Перевод на русский язык сделал Yaro2709;
// Все права защищены 2020 г.;
// Company 1367.

$LNG['all']                                          = 'Все';
//Сообщения
$LNG['mg_type'][200]                                 = 'Архив';
$LNG['mg_text']                                      = 'Текст';
$LNG['mg_arh_mess']                                  = 'В архив все выделенные сообщения';
$LNG['mg_arh']                                       = 'В архив';
$LNG['mg_del']                                       = 'Удалить';
$LNG['mg_fre']                                       = 'Предложить подружиться';
//Настройки
$LNG['op_user']                                      = 'Пользователь';
$LNG['op_vacation']                                  = 'Режим отпуска';
$LNG['op_foto']                                      = 'Аватар (добавьте URL адрес)';
$LNG['op_background']                                = 'Фон (добавьте URL адрес)';
//Рекорды
$LNG['rec_you']                                      = 'У вас';
$LNG['rec_record']                                   = 'Рекорд';
$LNG['rec_user_top']                                 = 'Рекорд установили';
//Ресурсы
$LNG['res_disable']                                  = 'Отключить добычу на всех планетах';
$LNG['res_activate']                                 = 'Включить добычу на всех планетах';
$LNG['res_cl_dactivate']                             = 'Добыча на всех планетах отключена';
$LNG['res_cl_activate']                              = 'Добыча на всех планетах включена ';
//Купля - продажа
$LNG['bd_limit']                  	  	             = 'Вы не можите столько купить!';
$LNG['bd_notres']                                    = 'Недостаточно ресурсов!';
$LNG['bd_buy']                                       = 'Купить';
$LNG['bd_support']                                   = 'Поддержать';
$LNG['bd_time_day']                                  = 'Дней:';
$LNG['bd_time_weeks']                                = 'Недель:';
$LNG['bd_lvl_up']                                    = 'Ур.:';
$LNG['bd_quantity_up']                               = 'Кол.:';
$LNG['bd_active']                                    = 'Активен:';
$LNG['bd_recharge']                                  = 'Перезарядка:';
$LNG['bd_restart_no']                                = 'Ждите...';
$LNG['bd_total']                                     = 'Всего:';
$LNG['bd_the_initial_cost']                          = 'Начальная стоимость:';
$LNG['bd_the_cost']                                  = 'Стоимость:';
$LNG['bd_buy_yes']                                   = 'Куплено!';
$LNG['bd_buy_no_tech']                               = 'У Вас не октрыта ни одна единица!';
$LNG['bd_needed_tech']                               = 'Для постройки необходимо:';
//Поддержка
$LNG['ti_category_error']                            = 'Ошибка';
$LNG['ti_category_bug']                              = 'Баг';
$LNG['ti_category_language']                         = 'Языковая ошибка';
$LNG['ti_mess']                                      = 'Сообщение';
//Suppot
$LNG['nt_text']                                      = 'Текст';
$LNG['nt_title']                                     = 'Тема';
//Umperium
$LNG['lv_sum']                                       = 'Сумма';
$LNG['lv_resources_h']                               = 'Ресурсы в час';
$LNG['lv_max']							             = 'Все';
$LNG['lv_max_planet']					             = 'Планеты';
$LNG['lv_max_moon']						             = 'Луны';
$LNG['lv_max_colon']                                 = 'Статус планет (колонизация): ';
$LNG['lv_go_planet']                                 = 'Продолжить';
//Орбита
$LNG['fl_fleet_grops']                               = 'Группы флотов';
$LNG['fl_new_grops']                                 = 'Добавить слот Группы флотов';
$LNG['fl_new_name_grops']                            = 'Укажите название сохраняемой группы';
$LNG['fl_fleet_points']                              = 'Очков флота выбрано';
$LNG['fl_grop_1']                                    = 'Боевой флот';
$LNG['fl_grop_2']                                    = 'Транспорт';
$LNG['fl_grop_3']                                    = 'Переработчики';
$LNG['fl_grop_4']                                    = 'Особые';
//Постройки
$LNG['bd_free_field']                                = 'Свободно:';
$LNG['bd_em_field']                                  = 'Полей занято:';
$LNG['bd_of_field']                                  = 'из';
$LNG['short_day']                                    = 'д';
$LNG['short_hour']                                   = 'ч';
$LNG['short_minute']                                 = 'м';
$LNG['short_second']                                 = 'с';
//Ускоритель
$LNG['cost']							             = 'Цена'; 
//Обзор
$LNG['ov_ticket']                                    = 'Тех. поддержка';
$LNG['ov_ticket_tooltip']                            = 'Отвечу на ваши вопросы';
$LNG['ov_online_users']                              = 'Игроков онлайн:';
$LNG['ov_create_moon']                               = 'Создать луну';
$LNG['ov_panel_root']                                = 'Панель управления';
//Навигация
$LNG['lm_market']                                    = 'Рынок';
$LNG['lm_blueprints']                                = 'Чертежи';
$LNG['lm_race']                                      = 'Расы';
$LNG['lm_premium']                                   = 'Премиум';
$LNG['lm_bonus']					                 = 'Бонус'; 
$LNG['lm_infobonus']					             = 'Бонусы'; 
$LNG['lm_createmoon']					             = 'Создание луны'; 
$LNG['lm_ars']					                     = 'Арсенал';
$LNG['lm_container']					             = 'Контейнеры';
$LNG['lm_artifact']					                 = 'Артефакты';
$LNG['lm_development']					             = 'Инновационные разработки';
$LNG['lm_achievements']					             = 'Достижения';
$LNG['lm_formgovernment']					         = 'Форма правления';
$LNG['lm_ethics']					                 = 'Этика';
$LNG['lm_party']					                 = 'Партии';
$LNG['lm_ideologies']					             = 'Идеология';
$LNG['lm_band']					                     = 'Наёмники';
$LNG['lm_bon']					                     = 'Контейнеры Древних';
$LNG['lm_fair']					                     = 'Ярмарка';
$LNG['lm_auction']					                 = 'Аукцион';
$LNG['lm_buybuild']					                 = 'Покупка построек';
$LNG['lm_buytech']					                 = 'Покупка исследований';
$LNG['lm_buyfleet']					                 = 'Покупка флота';
$LNG['lm_buydefense']					             = 'Покупка обороны';
$LNG['lm_planet']					                 = 'Планетарий';
$LNG['lm_reduceresources']					         = 'Свезти с планет ресурсы';
$LNG['lm_reducefleet']					             = 'Свезти с планет флот';
$LNG['lm_delivery']					                 = 'Распределить ресурсы с планет';
$LNG['lm_finddebris']					             = 'Поиск обломков';
$LNG['lm_store']                                     = 'Магазин';
$LNG['lm_minerals']                                  = 'Минералы';
$LNG['lm_details']                                   = 'Детали';
$LNG['PPS']                                          = 'Производство за час';
$LNG['PPD']                                          = 'Производство в день';
$LNG['PPW']                                          = 'Производство в неделю';
$LNG['RE']                                           = 'Доступно:';
//Статистика
$LNG['st_next']                                      = 'Следующее обновление';
//Mapкет
$LNG['market_indicated']                             = 'Цена не указана.';
$LNG['market_exposed']                               = 'Лот выставлен!';
$LNG['market_not_enough_money']                      = 'У вас не хваает ресурсов!';
$LNG['market_buy']                                   = 'Все было куплено!';
$LNG['market_take_off']                              = 'Лот был снят с продажи!';
$LNG['market_lot_active']                            = 'Лоты на рынке';
$LNG['market_go_lot']                                = 'Выставить лот';
$LNG['market_you_lot']                               = 'Ваши лоты';
$LNG['market_not_lot']                               = 'Лотов нет!';
$LNG['market_not_res']                               = 'Вам не чего предложить на рынок!';
$LNG['market_not_lot_active']                        = 'У Вас нет выставленных лотов!';
$LNG['market_take']                                  = 'Снять лот';
$LNG['market_proceed']                               = 'Продолжить';
$LNG['market_price']                                 = 'Цена:';
$LNG['market_all']                                   = 'Все';
$LNG['market_lot']                                   = 'Лот';
//Альянсы
$LNG['all_of']                                       = 'из';
$LNG['all_member']                                   = 'участников';
$LNG['all_status']                                   = 'Обзор альянса';
$LNG['all_info']                                     = 'Информация';
$LNG['all_appl']                                     = 'Настройка заявок';
$LNG['all_create']                                   = 'Создать ранг';
$LNG['al_development']        			             = 'Развитие альянса';
$LNG['al_storage']        				             = 'Хранилище альянса';
$LNG['al_issue']				 	                 = 'Выдать';
$LNG['al_issue_ally_storage']	 	                 = 'Выдать из банк альянса';
$LNG['al_vlyat']				 	                 = 'Взять';
$LNG['al_vlyat_ally_storage']	 	                 = 'Взять из банк альянса';
$LNG['al_put']				 	  		             = 'Сделать вклад';
$LNG['al_summ_max']				 	  	             = 'Максимум';
$LNG['al_summ_all']				 	  	             = 'Сумма';
$LNG['al_in_storage']        			             = 'В наличии';
$LNG['al_ally_planets']                	             = 'Планеты альянса';
$LNG['al_storage_msg_enter']        			     = 'Введите ресурсы!';
$LNG['al_storage_msg_much']        			         = 'Слишком много!';
$LNG['al_storage_msg_not']        			         = 'Не хватает!';
$LNG['al_storage_msg_success']        			     = 'Вклад выполнен.';
$LNG['al_storage_msg_received']        			     = 'Ресурсы получены.';
$LNG['al_storage_msg_issued']        			     = 'Ресурсы выданы.';
$LNG['al_storage_msg_coordinates']        			 = 'Не выбраны координаты доставки ресурсов.';
//Расы
$LNG['race_one']                                     = 'Выбор расы:';
$LNG['race_yes']                  	  	             = 'Раса выбрана.';
//Конвейер
$LNG['sec_conv']						             = 'в сек.';
//Инфо-бонус
$LNG['inb_percent']                                  = 'В процентах';
$LNG['inb_units']                                    = 'В единицах';
$LNG['inb_name']                                     = 'Название';
//Создание луны
$LNG['crm_value']                                    = 'Для создания луны требуется:';
$LNG['crm_war']                                      = 'У луны рандомный диаметр!';
$LNG['crm_create']                                   = 'Луна успешно создана!';
$LNG['crm_moon_is']                                  = 'У Вас уже есть луна на этой планете!';
$LNG['crm_not_res']                                  = 'У Вас недостаточно ресурсов!';
//Контейнеры
$LNG['cont_open_go']					             = 'Открыть';
$LNG['cont_open_24']					             = 'Октрыто за 24 часа.';
$LNG['cont_msg_limit']			                     = 'Нельзя открыть столько контейнеров за раз.';
$LNG['cont_not_cont_user']                           = 'Не хватает контейнеров!';
$LNG['cont_open']                                    = 'Вы открыли:';
//Информация
$LNG['in_attack_pt']   			                     = 'Стандартная атака';
$LNG['in_attack_laser']   			                 = 'Лазерная атака';
$LNG['in_attack_ionic']   			                 = 'Ионная атака';
$LNG['in_attack_buster']   			                 = 'Плазменная атака';
$LNG['in_attack_graviton']   			             = 'Гравитационная атака';
$LNG['in_shield_none']                               = 'Щиты отсутствуют';
$LNG['in_shield_light']   			                 = 'Легкие щиты';
$LNG['in_shield_medium']   			                 = 'Средние щиты';
$LNG['in_shield_heavy']   			                 = 'Тяжелые щиты';
$LNG['in_armor_light']   			                 = 'Легкая броня';
$LNG['in_armor_medium']   			                 = 'Средняя броня';
$LNG['in_armor_heavy']   			                 = 'Тяжелая броня';
$LNG['in_number']   	                             = 'Количество';
$LNG['in_recovery']   	                             = 'Оборона восстанавливается после боя.';
//Система
$LNG['sys_expe_found_ars_1']                         = 'Мы нашли поле битвы и нам удалась создать апгрейд';
$LNG['sys_expe_found_ars_2']                         = 'Новый командир разрешил вступить в контакт с новой расой, хоть это и нарушает устав. Она оказалось довольно дружелюбной, и мы смогли наладить торговые отношения. Удачно проделав обмен, экспедиция получила апгрейд';
$LNG['sys_expe_found_ars_3']                         = 'Новая команда решила воспользоваться новым поисковым модулем. В результате экспедиция быстро смогла найти астероид. Изучив его, команда нашла апгрейд';
$LNG['sys_expe_found_ars_4']                         = 'Экспедиция нашла сломанного дройда более совершенной расы. Разобрав его, команда смогла создать апгрейд';
$LNG['sys_expe_found_ars_5']                         = 'Экспедиция должна была возвратится домой с пустыми руками, но в конце маршрута мы нашли большой разрушенный планетоид. Долго и тщательно изучая его, команда смогла создать апгрейд';
$LNG['sys_expe_found_ars_6']                         = 'Начало экспедиции уже было плохим. На середине пути большинство членов команды заболели, но, к счастью, на пути нам встретился корабль чужих. Мы смогли договорится об обмене дейтерия, которого у нас было много, на излечение команды и апгрейд';
$LNG['sys_expe_found_ars_7']                         = 'Команда считает, что это экспедиция была довольно успешной. Мы смогли сделать очень много интересных фотографий космоса и думаем, что они победят на конкурсе, а также почти в начале пути нашли апгрейд';
$LNG['sys_expe_found_container_1']                   = 'Экспедиция была не особо успешной. Мы проделали несколько безуспешных высадок на планетоиды, а также пытались добыть ресурсы из астероидов, но, к сожалению, каждый раз ломалась аппаратура или в худшем случае данные были неверными. По пути домой нам попалось поле битвы. Оно появилось не так давно, и мы смогли это законсервировать в контейнеры';
$LNG['sys_expe_found_container_2']                   = 'Умный командир оборудовал корабль новейшим оборудованием. Это нам помогло быстро найти почти разрушенный планетоид. Изучая, мы нашли данные. В них была зафиксирована история последних событий, а также план устройства планеты. Он нам помог найти нам хранилище с контейнерами';
$LNG['sys_expe_found_container_3']                   = 'Экспедиция была довольно интересной и успешной. Мы повстречали много различных рас, сделали эксперименты и даже успели хорошо отдохнуть. В конце же мы залетели уже на давно отмеченное место, где обычно добывали ресурсы, но на этот раз мы увидели поле недавней битвы. Мы смогли все законсервировать в контейнеры';
$LNG['sys_expe_found_container_4']                   = 'Мы долго блуждали по пустому космосу, потому что командир неудачно выбрал курс нашего пути. Нарушив устав, мы единогласно посадили его в карцер. Поменяв путь экспедиции, команда нашла корабли другой расы, на которых были контейнеры';
$LNG['sys_expe_found_container_5']                   = 'Экспедиция не отняла много сил у команды. В самом начале пути мы зафиксировали сигнал. Подлетев ближе к объекту, мы поняли, что это торговый корабль. Команда обменяла темную материю на контейнеры';
$LNG['sys_expe_found_so_1']                          = 'Экспедиция наткнулась на потухшую звезду и смогла добыть одну <span style="color:#e8ce10">Звездную Руду</span>.';
$LNG['sys_expe_found_so_2']                          = 'Экспедиция наткнулась на уничтоженную систему после взрыва звезды и нашла одну одну <span style="color:#e8ce10">Звездную Руду</span>.';
$LNG['sys_expe_found_so_3']                          = 'Экспедиция обнаружила сломанный реактор черной дыры и из него добыла одну <span style="color:#e8ce10">Звездную Руду</span>.';
$LNG['sys_expe_found_so_4']                          = 'Экспедиция нашла покинутую систему Древних. На одной планете был склад ресурсов, где нашли одну <span style="color:#e8ce10">Звездную Руду</span>.';
$LNG['sys_expe_found_so_5']                          = 'Экспедиция попала в странную аномалию, после которой мы оказались около покинутой базы пиратов. В ангаре была найдена одна <span style="color:#e8ce10">Звездная руда</span>.';
$LNG['sys_expe_found_so_6']                          = 'Экспедиция наткнулась на неизвестны корабль. В ходе переговоров мы обменяли Темную Материю на одну <span style="color:#e8ce10">Звездную Руду</span>.';
$LNG['sys_expe_found_so_7']                          = 'Экспедиция была неуспешной. Но на обратном пути мы нашли контейнер, в котором оказалась одна <span style="color:#e8ce10">Звездная Руда</span>.';
//Достижения
$LNG['ach_system']					                 = 'Система';
$LNG['ach_reached']					                 = 'Достигнуто:';
$LNG['ach_bonus']					                 = 'Посмотреть бонус';
$LNG['ach_next_upg']					        	 = 'Бонус на следующем уровне:';
$LNG['ach_remaining']					        	 = 'Осталось:';
$LNG['ach_go_achievements']					         = 'Перейти к достижениям';
//Форма правления
$LNG['fg_one']                                       = 'Выбор формы правления:';
$LNG['fg_yes']                  	  	             = 'Форма правления выбрана.';
//Этика
$LNG['et_one']                                       = 'Выбор этики:';
$LNG['et_yes']                  	  	             = 'Этика выбрана.';
//Партия
$LNG['party_stop_time']                  	  	     = 'Партия уже выбрана!';
//Планетарий
$LNG['pla_notenogu']                                 = 'Не хватает Темной материи';
$LNG['pla_tel_fleet']                                = 'Флот в полёте';
$LNG['pla_no_planet']                                = 'Вы должны телепортироваться с планеты';
$LNG['pla_tel_busy']                                 = 'Координаты заняты';
$LNG['pla_reactor']                                  = 'Реактор не остыл!';
$LNG['pla_tel_ok']                                   = 'Планета телепортированна';
$LNG['pla_added']                                    = 'Добавлено!';
$LNG['pla_error']                                    = 'Ошибка!';
$LNG['pla_increase_in_fields']                       = 'Увеличение полей на планете';
$LNG['pla_increase_in_diameter']                     = 'Увеличение диаметра планеты';
$LNG['pla_incre_ok']                                 = 'Увеличить';
$LNG['pla_tele_pal']                                 = 'Телепортация планеты';
$LNG['pla_tele_gal']                                 = ' Галактика';
$LNG['pla_tele_sys']                                 = ' Система';
$LNG['pla_tele_pla']                                 = ' Планета';
$LNG['pla_tel_next']                                 = 'в не системы, будет доступна';
$LNG['pla_tele_sub']                                 = 'Телепортировать';
$LNG['pla_gen']                                      = 'Генерировать';
$LNG['pla_new_name']                                 = 'Новое имя планете';
$LNG['pla_del']                                      = 'Удаление планеты';
$LNG['pla_pass']                                     = 'Пароль';
$LNG['pla_send']                                     = 'Ок';
//Развоз ресурсов
$LNG['rd_select_palet_res']					         = 'Выберите планеты для отправки ресурсов';
$LNG['rd_not_nid_fleet'] 					         = 'Нет подходящего флота';
$LNG['rd_not_deiterium'] 					         = 'Недостаточно дейтерия';
$LNG['rd_not_conpustion'] 					         = 'Недостаточная грузоподъёмность';
$LNG['rd_select_palet_fleet']				         = 'Выберите планеты для отправки флота';
$LNG['rd_compustion'] 						         = 'Потребление дейтерия';
$LNG['rd_sell'] 					                 = 'Стоимость';
$LNG['rd_planet_no'] 					             = 'Вы не уазали планеты.'; 
$LNG['rd_fleet_go'] 					             = 'Флот отправлен.';
$LNG['rd_fleet_po'] 					             = 'Вы находитесь в режиме отпуска.'; 
$LNG['rd_fleet_slot'] 					             = 'Все слоты флота заняты.'; 
$LNG['rd_erorr'] 					                 = 'Ошибка!'; 
$LNG['rd_select_all'] 						         = 'Выбрать все';
$LNG['rd_reset_all'] 						         = 'Сбросить выбор';
$LNG['rd_planet_no_fleet'] 						     = 'Нет подходящих планет';
//Искатель обломков
$LNG['debris_title']                                 = 'Искатель мусора';
$LNG['debris_show']                                  = 'Показать';
$LNG['debris_range']                                 = 'Спектор';
$LNG['debris_action_1']                              = 'Галактика';
$LNG['debris_action_2']                              = 'Система';
$LNG['debris_action_3']                              = 'Планета';
$LNG['debris_action_4']                              = 'Металл';
$LNG['debris_action_5']                              = 'Кристалл';
$LNG['debris_action_6']                              = 'Собрать';
$LNG['debris_action_7']                              = 'Нет обломков';
//Галактика
$LNG['gl_sp']                                        = 'Разведданные';
//Карта игрока
$LNG['op_user_info']                                 = 'Об игроке';
$LNG['op_damage_coef']                               = 'Коэффициент урона';
// Экспедиции
$LNG['fl_enemy'][1]                   	             = 'Пираты';
$LNG['fl_enemy'][2]                   	             = 'Чужие';
$LNG['fl_enemy'][3]                   	             = 'Древние';
$LNG['fl_enemy_text'][1]                  	         = '
<b>Пираты:</b><br>
Шанс нахождения апгрейда: 10%<br>
Количество флота 60-70% от флота запущенного игроком.<br>
Технологии Пирата 60-70% от технологий игрока.<br>
Базовый шанс нахождения Темной материи 30%<br>
Минимальное количество очков флота 2.500<br>
Максимальное количество очков флота не ограничено<br>
Процент сбора обломков от флота: 1%<br>';
$LNG['fl_enemy_text'][2]                  	         = '
<b>Чужие:</b><br>
Шанс нахождения апгрейда: 10%<br>
Количество флота 70-80% от флота запущенного игроком.<br>
Технологии Чужого 70-80% от технологий игрока.<br>
Базовый шанс нахождения Темной материи 30%<br>
Минимальное количество очков флота 15.000<br>
Максимальное количество очков флота не ограничено<br>
Процент сбора обломков от флота: 2%<br>';
$LNG['fl_enemy_text'][3]                  	         = '
<b>Древние:</b><br>
Шанс нахождения апгрейда: 10%<br>
Количество флота 80-90% от флота запущенного игроком.<br>
Технологии Древнего 80-90% от технологий игрока.<br>
Базовый шанс нахождения Темной материи 30%<br>
Минимальное количество очков флота 25.000<br>
Максимальное количество очков флота не ограничено<br>
Процент сбора обломков от флота: 3%<br>';
$LNG['batl_log_mesage']				                 = '<div class="raportMessage">
	<table>
		<tr>
			<td colspan="2"><a href="CombatReport.php?raport=%s" onclick="starttraining20()" target="_blank"><span %s>%s %s (%s)</span></a></td>
		</tr>
		<tr>
			<td>%s</td><td><span %s>%s: %s</span>&nbsp;<span %s>%s: %s</span></td>
		</tr>
		<tr>
			<td>%s</td><td><span>%s:&nbsp;<span style="color:#a47d7a;">%s</span>&nbsp;</span><span>%s:&nbsp;<span style="color:#5ca6aa;">%s</span>&nbsp;</span><span>%s:&nbsp;<span style="color:#339966;">%s</span></span></td>
		</tr>
		<tr>
			<td>%s</td><td><span>%s:&nbsp;<span style="color:#a47d7a;">%s</font>&nbsp;</span><span>%s:&nbsp;<span style="color:#5ca6aa;">%s</span></span></td>
		</tr>
	</table>
</div>' ;
$LNG['host_mission_mesag']                           = 'сектор "Туманность"';
$LNG['fl_enemy_msg']['main']		                 = 'Экспедиция наткнулась на вражеский отряд %s в секторе Туманность.';
$LNG['fl_enemy_msg']['tm']			                 = 'Был найден контейнер с %s Темной материи.';
$LNG['fl_enemy_msg']['up']			                 = 'Удалось создать Апгрейд для %s в количестве %s шт';