<?php
// Перевод на русский язык сделал Yaro2709;
// Все права защищены 2020 г.;
// Company 1367.

//НАВИГАЦИЯ:
//{IDs_0001} Глобальные
//{IDs_0002} Выбор вселенной
//{IDs_0003} Кнопки
//{IDs_0004} Авторизация
//{IDs_0005} Регистрация
//{IDs_0006} Активация учётной записи
//{IDs_0007} Восстановление пароля
//{IDs_0008} Ошибки авторизации
//{IDs_0009} Новости
//{IDs_0010} Контакты

//{IDs_0001} Глобальные
$LNG['nav_forum']                                    = 'Форум';
$LNG['nav_index']                                    = 'Главная';
$LNG['nav_news']                                     = 'Новости';
$LNG['nav_rules']                                    = 'Правила';
$LNG['nav_banlist']                                  = 'Заблокированные';
$LNG['nav_battlehall']                               = 'Зал славы';
$LNG['nav_disclamer']                                = 'Контакты';
$LNG['nav_register']                                 = 'Регистрация';
$LNG['nav_password']                                 = 'Восстановление пароля';
$LNG['nav_screens']                                  = 'Скриншоты';
$LNG['back']                                         = 'Назад';
$LNG['next']                                         = 'Далее'; 
$LNG['previous_s']                                   = '';
$LNG['next_s']                                       = '';
$LNG['footer_up']                                    = 'Наверх';
$LNG['language']                                     = 'Язык';
//{IDs_0002} Выбор вселенной
$LNG['chose_a_uni']                                  = 'Выбрать...';
$LNG['universe']                                     = 'Вселенная';
$LNG['uni_closed']                                   = ' (отключена)';
//{IDs_0003} Кнопки
$LNG['buttonRegister']                               = 'Зарегистрироваться';
$LNG['buttonLostPassword']                           = 'Забыли пароль?';
//{IDs_0004} Авторизация
$LNG['loginUsername']                                = 'Логин';
$LNG['loginPassword']                                = 'Пароль';
$LNG['loginButton']                                  = 'Войти';
$LNG['loginInfo']                                    = 'Со входом в игру я принимаю %s.';
$LNG['loginWelcome']                                 = 'Добро пожаловать в %s';
$LNG['loginServerDesc']                              = '%s - это стратегический космический симулятор в реальном времени. Сражайтесь с тысячами игроков во всём мире одновременно, чтобы стать лучшим.';
$LNG['loginScreens']                                 = 'Эй! Не игнорируй меня! Ты пропустишь самую лучшую галерею!';
//{IDs_0005} Регистрация
$LNG['registerUsername']                             = 'Логин';
$LNG['registerUsernameDesc']                         = 'Логин должен содержать от 3 до 25 символов и состоять только из букв, цифр, пробелов и символов "_", "-", "."';
$LNG['registerPassword']                             = 'Пароль';
$LNG['registerPasswordDesc']                         = 'Пароль должен содержать не менее 8 символов.';
$LNG['registerPasswordReplay']                       = 'Пароль (подтверждение)';
$LNG['registerPasswordReplayDesc']                   = 'Пожалуйста, повторите ввод пароля';
$LNG['registerEmail']                                = 'Элек. почта';
$LNG['registerEmailDesc']                            = 'Пожалуйста, введите адрес электронной почты.';
$LNG['registerEmailReplay']                          = 'Электронная почта (подтверждение)';
$LNG['registerEmailReplayDesc']                      = 'Пожалуйста, повторите ввод адреса электронной почты.';
$LNG['registerReferral']                             = 'Пригласил';
$LNG['registerCaptcha']                              = 'Защитный код';
$LNG['registerCaptchaDesc']                          = 'Пожалуйста, введите ниже буквы, которые показаны на картинке. Верхний и нижний регистр букв нужно соблюдать. Если вы не разобрали буквы на изображении даже после многократных обновлений кода, пожалуйста, свяжитесь с администратором игры.';
$LNG['registerRulesDesc']                            = 'Я согласен и принимаю %s.';
$LNG['registerErrorUniClosed']                       = 'Регистрация в данной вселенной закрыта.';
$LNG['registerErrorUsernameEmpty']                   = 'Вы не ввели логин.';
$LNG['registerErrorUsernameChar']                    = 'Логин может состоять только из букв, цифр, пробелов и символов "_", "-", "."';
$LNG['registerErrorUsernameExist']                   = 'Указанный логин уже зарегистрирован.';
$LNG['registerErrorPasswordLength']                  = 'Пароль должен содержать не менее 8 символов.';
$LNG['registerErrorPasswordSame']                    = 'Указанные пароли не совпадают.';
$LNG['registerErrorMailEmpty']                       = 'Вы не ввели адрес электронной почты.';
$LNG['registerErrorMailInvalid']                     = 'Адрес электронной почты введён неправильно.';
$LNG['registerErrorMailSame']                        = 'Указанные адреса электронной почты не совпадают.';
$LNG['registerErrorMailExist']                       = 'Указанный адрес электронной почты уже зарегистрирован.';
$LNG['registerErrorRules']                           = 'Вы не приняли правила игры.';
$LNG['registerErrorCaptcha']                         = 'Защитный код введён неправильно.';
$LNG['registerMailVertifyTitle']                     = 'Активация аккаунта на сайте %s';
$LNG['registerMailCompleteTitle']                    = 'Добро пожаловать в %s!';
$LNG['registerSendComplete']                         = 'Спасибо за регистрацию. В ближайшее время Вы получите по электронной почте письмо с дополнительной информацией.';
$LNG['registerWelcomePMSenderName']                  = 'Администратор';
$LNG['registerWelcomePMSubject']                     = 'Добро пожаловать';
$LNG['registerWelcomePMText']                        = 'Добро пожаловать в %s! Первым делом постройте солнечную электростанцию??, потому что энергия необходима для последующего производства ресурсов. Для этого нажмите кнопку "Постройки" в левом меню. Затем постройте четвёртое здание сверху. Теперь у Вас есть энергия, Вы можете начать строить шахты. Вернитесь в меню "Постройки" и постройте шахту металла, затем шахту кристалла. Чтобы строить корабли Вам нужно сначала построить Верфь. Что для этого нужно Вы найдёте в левом меню "Технологии". Команда проекта желает вам много удовольствия в исследовании Вселенной!';
//{IDs_0006} Активация учётной записи
$LNG['vertifyNoUserFound']                           = 'Неверный запрос.';
$LNG['vertifyAdminMessage']                          = 'Учётная запись "%s" активирована.';
//{IDs_0007} Восстановление пароля
$LNG['passwordInfo']                                 = 'Если Вы забыли свой ??пароль, Вам нужно знать логин и адрес электронной почты, связанный с Вашим аккаунтом. Если Вы не знаете их, пожалуйста, свяжитесь с администратором игры.';
$LNG['passwordUsername']                             = 'Логин';
$LNG['passwordMail']                                 = 'Электронная почта';
$LNG['passwordSubmit']                               = 'Отправить';
$LNG['passwordErrorMailEmpty']                       = 'Вы не указали электронную почту.';
$LNG['passwordErrorUnknown']                         = 'Указанная учётная запись не найдена.';
$LNG['passwordErrorOnePerDay']                       = 'Запрос на восстановление пароля к этой учётной записи уже был произведён один раз за последние 24 часа. По соображениям безопасности пароль пользователя можно восстановить только один раз в день. Вы можете восстановить пароль для этой учётной записи снова через 24 часа.';
$LNG['passwordValidMailTitle']                       = 'Восстановление пароля на сайте %s';
$LNG['passwordValidMailSend']                        = 'В ближайшее время Вы получите по электронной почте письмо с дополнительной информацией.';
$LNG['passwordValidInValid']                         = 'Неверный запрос.';
$LNG['passwordChangedMailSend']                      = 'В ближайшее время Вы получите по электронной почте письмо с Вашим новым паролем.';
$LNG['passwordChangedMailTitle']                     = 'Новый пароль на сайте %s';
//{IDs_0008} Ошибки авторизации
$LNG['login_error_1']                                = 'Неправильный логин или пароль.';
$LNG['login_error_2']                                = 'Ваш текущий IP адрес отличается от IP адреса последней незавершённой сессии.';
$LNG['login_error_3']                                = 'Ваша сессия завершена.';
$LNG['login_error_4']                                = 'Произошла ошибка во внешней авторизации. Попробуйте ещё раз позже.';
//{IDs_0009} Новости
$LNG['news_from']                                    = '%s от %s';
$LNG['news_does_not_exist']                          = 'Нет новостей';
//{IDs_0010} Контакты
$LNG['disclamerLabelAddress']                        = 'Адрес:';
$LNG['disclamerLabelPhone']                          = 'Телефон:';
$LNG['disclamerLabelMail']                           = 'Электронная почта:';
$LNG['disclamerLabelNotice']                         = 'Дополнительная информация';